#include <stdio.h>

int main(void) {

    printf("[%f]\n", 1.123); // 浮動小数点 (デフォルトは6桁)
    printf("[%10f]\n", 1.123); // 最低10桁の浮動小数点(「1.」含めて)
    printf("[%-10f]\n", 1.123); // 最低10桁の左寄せの浮動小数点
    printf("[%010f]\n", 1.123); // 最低10桁の余白を0で埋めた浮動小数点
    printf("[%.2f]\n", 1.123); // 2桁精度の浮動小数点
    printf("[%.10f]\n", 1.123); // 10桁精度の浮動小数点
    printf("[%7.2f]\n", 1.123); // 最低7桁で2桁精度の浮動小数点
    printf("[%-7.2f]\n", 1.123); // 最低7桁で2桁精度の左寄せの浮動小数点
    printf("[%07.2f]\n", 1.123); // 最低7桁で2桁精度の余白を0で埋めた浮動小数点

    return (0);
}
